jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2012 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *******************************************************************************/
#define _SDIO_OPS_C_

#include <rtl8723b_hal.h>



static void HalSdioGetCmdAddr8723BSdio (
  IN  PADAPTER      padapter,
  IN  u8        DeviceID,
  IN  u32       Addr,
  OUT u32    *    pCmdAddr
)
{
  switch (DeviceID)
  {
  case SDIO_LOCAL_DEVICE_ID:
    *pCmdAddr = ( (SDIO_LOCAL_DEVICE_ID << 13) | (Addr & SDIO_LOCAL_MSK) );
    break;
    
  case WLAN_IOREG_DEVICE_ID:
    *pCmdAddr = ( (WLAN_IOREG_DEVICE_ID << 13) | (Addr & WLAN_IOREG_MSK) );
    break;
    
  case WLAN_TX_HIQ_DEVICE_ID:
    *pCmdAddr = ( (WLAN_TX_HIQ_DEVICE_ID << 13) | (Addr & WLAN_FIFO_MSK) );
    break;
    
  case WLAN_TX_MIQ_DEVICE_ID:
    *pCmdAddr = ( (WLAN_TX_MIQ_DEVICE_ID << 13) | (Addr & WLAN_FIFO_MSK) );
    break;
    
  case WLAN_TX_LOQ_DEVICE_ID:
    *pCmdAddr = ( (WLAN_TX_LOQ_DEVICE_ID << 13) | (Addr & WLAN_FIFO_MSK) );
    break;
    
  case WLAN_RX0FF_DEVICE_ID:
    *pCmdAddr = ( (WLAN_RX0FF_DEVICE_ID << 13) | (Addr & WLAN_RX0FF_MSK) );
    break;
    
  default:
    break;
  }
}

static u8 get_deviceid (u32 addr)
{
  u8 devideId;
  u16 pseudoId;
  
  
  pseudoId = (u16) (addr >> 16);
  switch (pseudoId)
  {
  case 0x1025:
    devideId = SDIO_LOCAL_DEVICE_ID;
    break;
    
  case 0x1026:
    devideId = WLAN_IOREG_DEVICE_ID;
    break;
    

  case 0x1031:
    devideId = WLAN_TX_HIQ_DEVICE_ID;
    break;
    
  case 0x1032:
    devideId = WLAN_TX_MIQ_DEVICE_ID;
    break;
    
  case 0x1033:
    devideId = WLAN_TX_LOQ_DEVICE_ID;
    break;
    
  case 0x1034:
    devideId = WLAN_RX0FF_DEVICE_ID;
    break;
    
  default:
    devideId = WLAN_IOREG_DEVICE_ID;
    break;
  }
  
  return devideId;
}

/*
 * Ref:
 *  HalSdioGetCmdAddr8723BSdio()
 */
static u32 _cvrt2ftaddr (const u32 addr, u8 * pdeviceId, u16 * poffset)
{
  u8 deviceId;
  u16 offset;
  u32 ftaddr;
  
  
  deviceId = get_deviceid (addr);
  offset = 0;
  
  switch (deviceId)
  {
  case SDIO_LOCAL_DEVICE_ID:
    offset = addr & SDIO_LOCAL_MSK;
    break;
    
  case WLAN_TX_HIQ_DEVICE_ID:
  case WLAN_TX_MIQ_DEVICE_ID:
  case WLAN_TX_LOQ_DEVICE_ID:
    offset = addr & WLAN_FIFO_MSK;
    break;
    
  case WLAN_RX0FF_DEVICE_ID:
    offset = addr & WLAN_RX0FF_MSK;
    break;
    
  case WLAN_IOREG_DEVICE_ID:
  default:
    deviceId = WLAN_IOREG_DEVICE_ID;
    offset = addr & WLAN_IOREG_MSK;
    break;
  }
  ftaddr = (deviceId << 13) | offset;
  
  if (pdeviceId) { *pdeviceId = deviceId; }
  if (poffset) { *poffset = offset; }
  
  return ftaddr;
}

u8 sdio_read8 (struct intf_hdl * pintfhdl, u32 addr)
{
  u32 ftaddr;
  u8 val;
  
  _func_enter_;
  ftaddr = _cvrt2ftaddr (addr, NULL, NULL);
  val = sd_read8 (pintfhdl, ftaddr, NULL);
  
  _func_exit_;
  
  return val;
}

u16 sdio_read16 (struct intf_hdl * pintfhdl, u32 addr)
{
  u32 ftaddr;
  u16 val;
  
  _func_enter_;
  ftaddr = _cvrt2ftaddr (addr, NULL, NULL);
  sd_cmd52_read (pintfhdl, ftaddr, 2, (u8 *) &val);
  val = le16_to_cpu (val);
  
  _func_exit_;
  
  return val;
}

u32 sdio_read32 (struct intf_hdl * pintfhdl, u32 addr)
{
  PADAPTER padapter;
  u8 bMacPwrCtrlOn;
  u8 deviceId;
  u16 offset;
  u32 ftaddr;
  u8 shift;
  u32 val;
  s32 err;
  
  _func_enter_;
  
  padapter = pintfhdl->padapter;
  ftaddr = _cvrt2ftaddr (addr, &deviceId, &offset);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( ( (deviceId == WLAN_IOREG_DEVICE_ID) && (offset < 0x100) )
       || (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = sd_cmd52_read (pintfhdl, ftaddr, 4, (u8 *) &val);
    #ifdef SDIO_DEBUG_IO
    if (!err) {
    #endif
      val = le32_to_cpu (val);
      return val;
      #ifdef SDIO_DEBUG_IO
    }
    
    DBG_8192C (KERN_ERR "%s: Mac Power off, Read FAIL(%d)! addr=0x%x\n", __func__, err, addr);
    return SDIO_ERR_VAL32;
      #endif
  }
  
  shift = ftaddr & 0x3;
  if (shift == 0) {
    val = sd_read32 (pintfhdl, ftaddr, NULL);
  }
  else {
    u8 * ptmpbuf;
    
    ptmpbuf = (u8 *) rtw_malloc (8);
    if (NULL == ptmpbuf) {
      DBG_8192C (KERN_ERR "%s: Allocate memory FAIL!(size=8) addr=0x%x\n", __func__, addr);
      return SDIO_ERR_VAL32;
    }
    
    ftaddr &= ~ (u16) 0x3;
    sd_read (pintfhdl, ftaddr, 8, ptmpbuf);
    _rtw_memcpy (&val, ptmpbuf + shift, 4);
    val = le32_to_cpu (val);
    
    rtw_mfree (ptmpbuf, 8);
  }
  
  _func_exit_;
  
  return val;
}

s32 sdio_readN (struct intf_hdl * pintfhdl, u32 addr, u32 cnt, u8 * pbuf)
{
  PADAPTER padapter;
  u8 bMacPwrCtrlOn;
  u8 deviceId;
  u16 offset;
  u32 ftaddr;
  u8 shift;
  s32 err;
  
  _func_enter_;
  
  padapter = pintfhdl->padapter;
  err = 0;
  
  ftaddr = _cvrt2ftaddr (addr, &deviceId, &offset);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( ( (deviceId == WLAN_IOREG_DEVICE_ID) && (offset < 0x100) )
       || (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = sd_cmd52_read (pintfhdl, ftaddr, cnt, pbuf);
    return err;
  }
  
  shift = ftaddr & 0x3;
  if (shift == 0) {
    err = sd_read (pintfhdl, ftaddr, cnt, pbuf);
  }
  else {
    u8 * ptmpbuf;
    u32 n;
    
    ftaddr &= ~ (u16) 0x3;
    n = cnt + shift;
    ptmpbuf = rtw_malloc (n);
    if (NULL == ptmpbuf) { return -1; }
    err = sd_read (pintfhdl, ftaddr, n, ptmpbuf);
    if (!err)
    { _rtw_memcpy (pbuf, ptmpbuf + shift, cnt); }
    rtw_mfree (ptmpbuf, n);
  }
  
