jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
  _func_exit_;
  
  return err;
}

s32 sdio_write8 (struct intf_hdl * pintfhdl, u32 addr, u8 val)
{
  u32 ftaddr;
  s32 err;
  
  _func_enter_;
  ftaddr = _cvrt2ftaddr (addr, NULL, NULL);
  sd_write8 (pintfhdl, ftaddr, val, &err);
  
  _func_exit_;
  
  return err;
}

s32 sdio_write16 (struct intf_hdl * pintfhdl, u32 addr, u16 val)
{
  u32 ftaddr;
  u8 shift;
  s32 err;
  
  _func_enter_;
  ftaddr = _cvrt2ftaddr (addr, NULL, NULL);
  val = cpu_to_le16 (val);
  err = sd_cmd52_write (pintfhdl, ftaddr, 2, (u8 *) &val);
  
  _func_exit_;
  
  return err;
}

s32 sdio_write32 (struct intf_hdl * pintfhdl, u32 addr, u32 val)
{
  PADAPTER padapter;
  u8 bMacPwrCtrlOn;
  u8 deviceId;
  u16 offset;
  u32 ftaddr;
  u8 shift;
  s32 err;
  
  _func_enter_;
  
  padapter = pintfhdl->padapter;
  err = 0;
  
  ftaddr = _cvrt2ftaddr (addr, &deviceId, &offset);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( ( (deviceId == WLAN_IOREG_DEVICE_ID) && (offset < 0x100) )
       || (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    val = cpu_to_le32 (val);
    err = sd_cmd52_write (pintfhdl, ftaddr, 4, (u8 *) &val);
    return err;
  }
  
  shift = ftaddr & 0x3;
  #if 1
  if (shift == 0)
  {
    sd_write32 (pintfhdl, ftaddr, val, &err);
  }
  else
  {
    val = cpu_to_le32 (val);
    err = sd_cmd52_write (pintfhdl, ftaddr, 4, (u8 *) &val);
  }
  #else
  if (shift == 0) {
    sd_write32 (pintfhdl, ftaddr, val, &err);
  }
  else {
    u8 * ptmpbuf;
  
    ptmpbuf = (u8 *) rtw_malloc (8);
    if (NULL == ptmpbuf) { return (-1); }
  
    ftaddr &= ~ (u16) 0x3;
    err = sd_read (pintfhdl, ftaddr, 8, ptmpbuf);
    if (err) {
      rtw_mfree (ptmpbuf, 8);
      return err;
    }
    val = cpu_to_le32 (val);
    _rtw_memcpy (ptmpbuf + shift, &val, 4);
    err = sd_write (pintfhdl, ftaddr, 8, ptmpbuf);
  
    rtw_mfree (ptmpbuf, 8);
  }
  #endif
  
  _func_exit_;
  
  return err;
}

s32 sdio_writeN (struct intf_hdl * pintfhdl, u32 addr, u32 cnt, u8 * pbuf)
{
  PADAPTER padapter;
  u8 bMacPwrCtrlOn;
  u8 deviceId;
  u16 offset;
  u32 ftaddr;
  u8 shift;
  s32 err;
  
  _func_enter_;
  
  padapter = pintfhdl->padapter;
  err = 0;
  
  ftaddr = _cvrt2ftaddr (addr, &deviceId, &offset);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( ( (deviceId == WLAN_IOREG_DEVICE_ID) && (offset < 0x100) )
       || (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = sd_cmd52_write (pintfhdl, ftaddr, cnt, pbuf);
    return err;
  }
  
  shift = ftaddr & 0x3;
  if (shift == 0) {
    err = sd_write (pintfhdl, ftaddr, cnt, pbuf);
  }
  else {
    u8 * ptmpbuf;
    u32 n;
    
    ftaddr &= ~ (u16) 0x3;
    n = cnt + shift;
    ptmpbuf = rtw_malloc (n);
    if (NULL == ptmpbuf) { return -1; }
    err = sd_read (pintfhdl, ftaddr, 4, ptmpbuf);
    if (err) {
      rtw_mfree (ptmpbuf, n);
      return err;
    }
    _rtw_memcpy (ptmpbuf + shift, pbuf, cnt);
    err = sd_write (pintfhdl, ftaddr, n, ptmpbuf);
    rtw_mfree (ptmpbuf, n);
  }
  
  _func_exit_;
  
  return err;
}

u8 sdio_f0_read8 (struct intf_hdl * pintfhdl, u32 addr)
{
  u32 ftaddr;
  u8 val;
  
  _func_enter_;
  val = sd_f0_read8 (pintfhdl, addr, NULL);
  
  _func_exit_;
  
  return val;
}

void sdio_read_mem (struct intf_hdl * pintfhdl, u32 addr, u32 cnt, u8 * rmem)
{
  s32 err;
  
  _func_enter_;
  
  err = sdio_readN (pintfhdl, addr, cnt, rmem);
  
  _func_exit_;
}

void sdio_write_mem (struct intf_hdl * pintfhdl, u32 addr, u32 cnt, u8 * wmem)
{
  _func_enter_;
  
  sdio_writeN (pintfhdl, addr, cnt, wmem);
  
  _func_exit_;
}

/*
 * Description:
 *  Read from RX FIFO
 *  Round read size to block size,
 *  and make sure data transfer will be done in one command.
 *
 * Parameters:
 *  pintfhdl  a pointer of intf_hdl
 *  addr    port ID
 *  cnt     size to read
 *  rmem    address to put data
 *
 * Return:
 *  _SUCCESS(1)   Success
 *  _FAIL(0)    Fail
 */
static u32 sdio_read_port (
  struct intf_hdl * pintfhdl,
  u32 addr,
  u32 cnt,
  u8 * mem)
{
  PADAPTER padapter;
  PSDIO_DATA psdio;
  PHAL_DATA_TYPE phal;
  u32 oldcnt;
  #ifdef SDIO_DYNAMIC_ALLOC_MEM
  u8 * oldmem;
  #endif
  s32 err;
  
  
  padapter = pintfhdl->padapter;
  psdio = &adapter_to_dvobj (padapter)->intf_data;
  phal = GET_HAL_DATA (padapter);
  
  HalSdioGetCmdAddr8723BSdio (padapter, addr, phal->SdioRxFIFOCnt++, &addr);
  
  oldcnt = cnt;
  if (cnt > psdio->block_transfer_len)
  { cnt = _RND (cnt, psdio->block_transfer_len); }

  if (oldcnt != cnt) {
    #ifdef SDIO_DYNAMIC_ALLOC_MEM
    oldmem = mem;
    mem = rtw_malloc (cnt);
    if (mem == NULL) {
      DBG_8192C (KERN_WARNING "%s: allocate memory %d bytes fail!\n", __func__, cnt);
      mem = oldmem;
      oldmem == NULL;
    }
    #else
    #endif
  }
  
  err = _sd_read (pintfhdl, addr, cnt, mem);
  
  #ifdef SDIO_DYNAMIC_ALLOC_MEM
  if ( (oldcnt != cnt) && (oldmem) ) {
    _rtw_memcpy (oldmem, mem, oldcnt);
    rtw_mfree (mem, cnt);
  }
  #endif
  
  if (err) { return _FAIL; }
  return _SUCCESS;
}

/*
 * Description:
 *  Write to TX FIFO
 *  Align write size block size,
 *  and make sure data could be written in one command.
 *
 * Parameters:
 *  pintfhdl  a pointer of intf_hdl
 *  addr    port ID
 *  cnt     size to write
 *  wmem    data pointer to write
 *
 * Return:
 *  _SUCCESS(1)   Success
 *  _FAIL(0)    Fail
 */
static u32 sdio_write_port (
  struct intf_hdl * pintfhdl,
  u32 addr,
  u32 cnt,
  u8 * mem)
{
  PADAPTER padapter;
  PSDIO_DATA psdio;
  s32 err;
  struct xmit_buf * xmitbuf = (struct xmit_buf *) mem;
  
  padapter = pintfhdl->padapter;
  psdio = &adapter_to_dvobj (padapter)->intf_data;
  
  if (padapter->hw_init_completed == _FALSE) {
    DBG_871X ("%s [addr=0x%x cnt=%d] padapter->hw_init_completed == _FALSE\n", __func__, addr, cnt);
    return _FAIL;
  }
  
  cnt = _RND4 (cnt);
  HalSdioGetCmdAddr8723BSdio (padapter, addr, cnt >> 2, &addr);
  
  if (cnt > psdio->block_transfer_len)
  { cnt = _RND (cnt, psdio->block_transfer_len); }

  err = sd_write (pintfhdl, addr, cnt, xmitbuf->pdata);
  
