jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
  rtw_sctx_done_err (&xmitbuf->sctx,
                     err ? RTW_SCTX_DONE_WRITE_PORT_ERR : RTW_SCTX_DONE_SUCCESS);
                     
  if (err) { return _FAIL; }
  return _SUCCESS;
}

void sdio_set_intf_ops (_adapter * padapter, struct _io_ops * pops)
{
  _func_enter_;
  
  pops->_read8 = &sdio_read8;
  pops->_read16 = &sdio_read16;
  pops->_read32 = &sdio_read32;
  pops->_read_mem = &sdio_read_mem;
  pops->_read_port = &sdio_read_port;
  
  pops->_write8 = &sdio_write8;
  pops->_write16 = &sdio_write16;
  pops->_write32 = &sdio_write32;
  pops->_writeN = &sdio_writeN;
  pops->_write_mem = &sdio_write_mem;
  pops->_write_port = &sdio_write_port;
  
  pops->_sd_f0_read8 = sdio_f0_read8;
  
  _func_exit_;
}

/*
 * Todo: align address to 4 bytes.
 */
s32 _sdio_local_read (
  PADAPTER  padapter,
  u32     addr,
  u32     cnt,
  u8   *   pbuf)
{
  struct intf_hdl * pintfhdl;
  u8 bMacPwrCtrlOn;
  s32 err;
  u8 * ptmpbuf;
  u32 n;
  
  
  pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if (_FALSE == bMacPwrCtrlOn)
  {
    err = _sd_cmd52_read (pintfhdl, addr, cnt, pbuf);
    return err;
  }
  
  n = RND4 (cnt);
  ptmpbuf = (u8 *) rtw_malloc (n);
  if (!ptmpbuf)
  { return (-1); }
  
  err = _sd_read (pintfhdl, addr, n, ptmpbuf);
  if (!err)
  { _rtw_memcpy (pbuf, ptmpbuf, cnt); }
  
  if (ptmpbuf)
  { rtw_mfree (ptmpbuf, n); }
  
  return err;
}

/*
 * Todo: align address to 4 bytes.
 */
s32 sdio_local_read (
  PADAPTER  padapter,
  u32     addr,
  u32     cnt,
  u8   *   pbuf)
{
  struct intf_hdl * pintfhdl;
  u8 bMacPwrCtrlOn;
  s32 err;
  u8 * ptmpbuf;
  u32 n;
  
  pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = sd_cmd52_read (pintfhdl, addr, cnt, pbuf);
    return err;
  }
  
  n = RND4 (cnt);
  ptmpbuf = (u8 *) rtw_malloc (n);
  if (!ptmpbuf)
  { return (-1); }
  
  err = sd_read (pintfhdl, addr, n, ptmpbuf);
  if (!err)
  { _rtw_memcpy (pbuf, ptmpbuf, cnt); }
  
  if (ptmpbuf)
  { rtw_mfree (ptmpbuf, n); }
  
  return err;
}

/*
 * Todo: align address to 4 bytes.
 */
s32 _sdio_local_write (
  PADAPTER  padapter,
  u32     addr,
  u32     cnt,
  u8   *   pbuf)
{
  struct intf_hdl * pintfhdl;
  u8 bMacPwrCtrlOn;
  s32 err;
  u8 * ptmpbuf;
  
  if (addr & 0x3)
  { DBG_8192C ("%s, address must be 4 bytes alignment\n", __FUNCTION__); }
  
  if (cnt  & 0x3)
  { DBG_8192C ("%s, size must be the multiple of 4 \n", __FUNCTION__); }
  
  pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = _sd_cmd52_write (pintfhdl, addr, cnt, pbuf);
    return err;
  }
  
  ptmpbuf = (u8 *) rtw_malloc (cnt);
  if (!ptmpbuf)
  { return (-1); }
  
  _rtw_memcpy (ptmpbuf, pbuf, cnt);
  
  err = _sd_write (pintfhdl, addr, cnt, ptmpbuf);
  
  if (ptmpbuf)
  { rtw_mfree (ptmpbuf, cnt); }
  
  return err;
}

/*
 * Todo: align address to 4 bytes.
 */
s32 sdio_local_write (
  PADAPTER  padapter,
  u32   addr,
  u32   cnt,
  u8  *  pbuf)
{
  struct intf_hdl * pintfhdl;
  u8 bMacPwrCtrlOn;
  s32 err;
  u8 * ptmpbuf;
  
  if (addr & 0x3)
  { DBG_8192C ("%s, address must be 4 bytes alignment\n", __FUNCTION__); }
  
  if (cnt  & 0x3)
  { DBG_8192C ("%s, size must be the multiple of 4 \n", __FUNCTION__); }
  
  pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    err = sd_cmd52_write (pintfhdl, addr, cnt, pbuf);
    return err;
  }
  
  ptmpbuf = (u8 *) rtw_malloc (cnt);
  if (!ptmpbuf)
  { return (-1); }
  
  _rtw_memcpy (ptmpbuf, pbuf, cnt);
  
  err = sd_write (pintfhdl, addr, cnt, ptmpbuf);
  
  if (ptmpbuf)
  { rtw_mfree (ptmpbuf, cnt); }
  
  return err;
}

u8 SdioLocalCmd52Read1Byte (PADAPTER padapter, u32 addr)
{
  u8 val = 0;
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  sd_cmd52_read (pintfhdl, addr, 1, &val);
  
  return val;
}

u16 SdioLocalCmd52Read2Byte (PADAPTER padapter, u32 addr)
{
  u16 val = 0;
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  sd_cmd52_read (pintfhdl, addr, 2, (u8 *) &val);
  
  val = le16_to_cpu (val);
  
  return val;
}

u32 SdioLocalCmd52Read4Byte (PADAPTER padapter, u32 addr)
{
  u32 val = 0;
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  sd_cmd52_read (pintfhdl, addr, 4, (u8 *) &val);
  
  val = le32_to_cpu (val);
  
  return val;
}

u32 SdioLocalCmd53Read4Byte (PADAPTER padapter, u32 addr)
{

  u8 bMacPwrCtrlOn;
  u32 val = 0;
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
  if ( (_FALSE == bMacPwrCtrlOn)
     #ifdef CONFIG_LPS_LCLK
       || (_TRUE == adapter_to_pwrctl (padapter)->bFwCurrentInPSMode)
     #endif
     )
  {
    sd_cmd52_read (pintfhdl, addr, 4, (u8 *) &val);
    val = le32_to_cpu (val);
  }
  else
  { val = sd_read32 (pintfhdl, addr, NULL); }
  
  return val;
}

void SdioLocalCmd52Write1Byte (PADAPTER padapter, u32 addr, u8 v)
{
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  sd_cmd52_write (pintfhdl, addr, 1, &v);
}

void SdioLocalCmd52Write2Byte (PADAPTER padapter, u32 addr, u16 v)
{
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  v = cpu_to_le16 (v);
  sd_cmd52_write (pintfhdl, addr, 2, (u8 *) &v);
}

void SdioLocalCmd52Write4Byte (PADAPTER padapter, u32 addr, u32 v)
{
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  HalSdioGetCmdAddr8723BSdio (padapter, SDIO_LOCAL_DEVICE_ID, addr, &addr);
  v = cpu_to_le32 (v);
  sd_cmd52_write (pintfhdl, addr, 4, (u8 *) &v);
}

