jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
}

void
DumpHardwareProfile8723Sdio (
  IN  PADAPTER    padapter
)
{
  DumpLoggedInterruptHistory8723Sdio (padapter);
}
#endif

static s32 ReadInterrupt8723BSdio (PADAPTER padapter, u32 * phisr)
{
  u32 hisr, himr;
  u8 val8, hisr_len;
  
  
  if (phisr == NULL)
  { return _FALSE; }
  
  himr = GET_HAL_DATA (padapter)->sdio_himr;
  
  hisr_len = 0;
  while (himr)
  {
    hisr_len++;
    himr >>= 8;
  }
  
  hisr = 0;
  while (hisr_len != 0)
  {
    hisr_len--;
    val8 = SdioLocalCmd52Read1Byte (padapter, SDIO_REG_HISR + hisr_len);
    hisr |= (val8 << (8 * hisr_len) );
  }
  
  *phisr = hisr;
  
  return _TRUE;
}

void InitInterrupt8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE pHalData;
  
  
  pHalData = GET_HAL_DATA (padapter);
  pHalData->sdio_himr = (u32) (      \
                                     SDIO_HIMR_RX_REQUEST_MSK      |
                                     #ifdef CONFIG_SDIO_TX_ENABLE_AVAL_INT
                                     SDIO_HIMR_AVAL_MSK          |
                                     #endif
                                     #if defined(CONFIG_LPS_LCLK) && !defined(CONFIG_DETECT_CPWM_BY_POLLING)
                                     SDIO_HIMR_CPWM1_MSK       |
                                     #endif
                                     0);
}

void InitSysInterrupt8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE pHalData;
  
  
  pHalData = GET_HAL_DATA (padapter);
  
  pHalData->SysIntrMask = (     \
                                0);
}

#ifdef CONFIG_WOWLAN
void ClearInterrupt8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE pHalData;
  u8 * clear;
  
  
  if (_TRUE == padapter->bSurpriseRemoved)
  { return; }
  
  pHalData = GET_HAL_DATA (padapter);
  clear = rtw_zmalloc (4);
  
  * (u32 *) clear = cpu_to_le32 (pHalData->sdio_hisr & MASK_SDIO_HISR_CLEAR);
  if (* (u32 *) clear)
  {
    sdio_local_write (padapter, SDIO_REG_HISR, 4, clear);
  }
  
  rtw_mfree (clear, 4);
}
#endif

void ClearSysInterrupt8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE pHalData;
  u32 clear;
  
  
  if (_TRUE == padapter->bSurpriseRemoved)
  { return; }
  
  pHalData = GET_HAL_DATA (padapter);
  
  clear = pHalData->SysIntrStatus & MASK_HSISR_CLEAR;
  if (clear)
  {
    rtw_write32 (padapter, REG_HSISR, clear);
  }
}

void EnableInterrupt8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE pHalData;
  u32 himr;
  
  #ifdef CONFIG_CONCURRENT_MODE
  if ( (padapter->isprimary == _FALSE) && padapter->pbuddy_adapter) {
    padapter = padapter->pbuddy_adapter;
  }
  #endif
  pHalData = GET_HAL_DATA (padapter);
  
  himr = cpu_to_le32 (pHalData->sdio_himr);
  sdio_local_write (padapter, SDIO_REG_HIMR, 4, (u8 *) &himr);
  
  RT_TRACE (_module_hci_ops_c_, _drv_notice_,
            ("%s: enable SDIO HIMR=0x%08X\n", __FUNCTION__, pHalData->sdio_himr) );
            
  himr = rtw_read32 (padapter, REG_HSIMR);
  rtw_write32 (padapter, REG_HSIMR, himr | pHalData->SysIntrMask);
  
  RT_TRACE (_module_hci_ops_c_, _drv_notice_,
            ("%s: enable HSIMR=0x%08X\n", __FUNCTION__, pHalData->SysIntrMask) );
            
  rtw_write8 (padapter, REG_C2HEVT_CLEAR, C2H_EVT_HOST_CLOSE);
}

void DisableInterrupt8723BSdio (PADAPTER padapter)
{
  u32 himr;
  
  #ifdef CONFIG_CONCURRENT_MODE
  if ( (padapter->isprimary == _FALSE) && padapter->pbuddy_adapter) {
    padapter = padapter->pbuddy_adapter;
  }
  #endif
  himr = cpu_to_le32 (SDIO_HIMR_DISABLED);
  sdio_local_write (padapter, SDIO_REG_HIMR, 4, (u8 *) &himr);
  
}

u8 CheckIPSStatus (PADAPTER padapter)
{
  DBG_871X ("%s(): Read 0x100=0x%02x 0x86=0x%02x\n", __func__,
            rtw_read8 (padapter, 0x100), rtw_read8 (padapter, 0x86) );
            
  if (rtw_read8 (padapter, 0x100) == 0xEA)
  { return _TRUE; }
  else
  { return _FALSE; }
}

#ifdef CONFIG_WOWLAN
void DisableInterruptButCpwm28723BSdio (PADAPTER padapter)
{
  u32 himr, tmp;
  
  #ifdef CONFIG_CONCURRENT_MODE
  if ( (padapter->isprimary == _FALSE) && padapter->pbuddy_adapter) {
    padapter = padapter->pbuddy_adapter;
  }
  #endif
  sdio_local_read (padapter, SDIO_REG_HIMR, 4, (u8 *) &tmp);
  DBG_871X ("DisableInterruptButCpwm28723BSdio(): Read SDIO_REG_HIMR: 0x%08x\n", tmp);
  
  himr = cpu_to_le32 (SDIO_HIMR_DISABLED) | SDIO_HIMR_CPWM2_MSK;
  sdio_local_write (padapter, SDIO_REG_HIMR, 4, (u8 *) &himr);
  
  sdio_local_read (padapter, SDIO_REG_HIMR, 4, (u8 *) &tmp);
  DBG_871X ("DisableInterruptButCpwm28723BSdio(): Read again SDIO_REG_HIMR: 0x%08x\n", tmp);
}
#endif
void UpdateInterruptMask8723BSdio (PADAPTER padapter, u32 AddMSR, u32 RemoveMSR)
{
  HAL_DATA_TYPE * pHalData;
  
  #ifdef CONFIG_CONCURRENT_MODE
  if ( (padapter->isprimary == _FALSE) && padapter->pbuddy_adapter) {
    padapter = padapter->pbuddy_adapter;
  }
  #endif
  pHalData = GET_HAL_DATA (padapter);
  
  if (AddMSR)
  { pHalData->sdio_himr |= AddMSR; }
  
  if (RemoveMSR)
  { pHalData->sdio_himr &= (~RemoveMSR); }
  
  DisableInterrupt8723BSdio (padapter);
  EnableInterrupt8723BSdio (padapter);
}

#ifdef CONFIG_MAC_LOOPBACK_DRIVER
static void sd_recv_loopback (PADAPTER padapter, u32 size)
{
  PLOOPBACKDATA ploopback;
  u32 readsize, allocsize;
  u8 * preadbuf;
  
  
  readsize = size;
  DBG_8192C ("%s: read size=%d\n", __func__, readsize);
  allocsize = _RND (readsize, adapter_to_dvobj (padapter)->intf_data.block_transfer_len);
  
  ploopback = padapter->ploopback;
  if (ploopback) {
    ploopback->rxsize = readsize;
    preadbuf = ploopback->rxbuf;
  }
  else {
    preadbuf = rtw_malloc (allocsize);
    if (preadbuf == NULL) {
      DBG_8192C ("%s: malloc fail size=%d\n", __func__, allocsize);
      return;
    }
  }
  
  sdio_read_port (&padapter->iopriv.intf, WLAN_RX0FF_DEVICE_ID, readsize, preadbuf);
  
  if (ploopback)
  { _rtw_up_sema (&ploopback->sema); }
  else {
    u32 i;
    
    DBG_8192C ("%s: drop pkt\n", __func__);
    for (i = 0; i < readsize; i += 4) {
      DBG_8192C ("%08X", * (u32 *) (preadbuf + i) );
      if ( (i + 4) & 0x1F) { printk (" "); }
      else { printk ("\n"); }
    }
    printk ("\n");
    rtw_mfree (preadbuf, allocsize);
  }
}
#endif

#ifdef CONFIG_SDIO_RX_COPY
static struct recv_buf * sd_recv_rxfifo (PADAPTER padapter, u32 size)
{
  u32 readsize, ret;
  u8 * preadbuf;
  struct recv_priv * precvpriv;
  struct recv_buf * precvbuf;
  
  
