jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
  #if 0
  readsize = size;
  #else
  readsize = RND4 (size);
  #endif
  
  precvpriv = &padapter->recvpriv;
  precvbuf = rtw_dequeue_recvbuf (&precvpriv->free_recv_buf_queue);
  if (precvbuf == NULL) {
    DBG_871X_LEVEL (_drv_err_, "%s: alloc recvbuf FAIL!\n", __FUNCTION__);
    return NULL;
  }
  
  if (precvbuf->pskb == NULL) {
    SIZE_PTR tmpaddr = 0;
    SIZE_PTR alignment = 0;
    
    precvbuf->pskb = rtw_skb_alloc (MAX_RECVBUF_SZ + RECVBUFF_ALIGN_SZ);
    
    if (precvbuf->pskb)
    {
      precvbuf->pskb->dev = padapter->pnetdev;
      
      tmpaddr = (SIZE_PTR) precvbuf->pskb->data;
      alignment = tmpaddr & (RECVBUFF_ALIGN_SZ - 1);
      skb_reserve (precvbuf->pskb, (RECVBUFF_ALIGN_SZ - alignment) );
    }
    
    if (precvbuf->pskb == NULL) {
      DBG_871X ("%s: alloc_skb fail! read=%d\n", __FUNCTION__, readsize);
      return NULL;
    }
  }
  
  preadbuf = precvbuf->pskb->data;
  ret = sdio_read_port (&padapter->iopriv.intf, WLAN_RX0FF_DEVICE_ID, readsize, preadbuf);
  if (ret == _FAIL) {
    RT_TRACE (_module_hci_ops_os_c_, _drv_err_, ("%s: read port FAIL!\n", __FUNCTION__) );
    return NULL;
  }
  
  
  precvbuf->len = size;
  precvbuf->phead = precvbuf->pskb->head;
  precvbuf->pdata = precvbuf->pskb->data;
  skb_set_tail_pointer (precvbuf->pskb, size);
  precvbuf->ptail = skb_tail_pointer (precvbuf->pskb);
  precvbuf->pend = skb_end_pointer (precvbuf->pskb);
  
  return precvbuf;
}
#else
static struct recv_buf * sd_recv_rxfifo (PADAPTER padapter, u32 size)
{
  u32 sdioblksize, readsize, allocsize, ret;
  u8 * preadbuf;
  _pkt * ppkt;
  struct recv_priv * precvpriv;
  struct recv_buf * precvbuf;


  sdioblksize = adapter_to_dvobj (padapter)->intf_data.block_transfer_len;
  #if 0
  readsize = size;
  #else
  readsize = RND4 (size);
  #endif

  if (readsize > sdioblksize)
  { allocsize = _RND (readsize, sdioblksize); }
  else
  { allocsize = readsize; }

  ppkt = rtw_skb_alloc (allocsize);

  if (ppkt == NULL) {
    RT_TRACE (_module_hci_ops_os_c_, _drv_err_, ("%s: alloc_skb fail! alloc=%d read=%d\n", __FUNCTION__, allocsize, readsize) );
    return NULL;
  }

  preadbuf = skb_put (ppkt, size);
  ret = sdio_read_port (&padapter->iopriv.intf, WLAN_RX0FF_DEVICE_ID, readsize, preadbuf);
  if (ret == _FAIL) {
    rtw_skb_free (ppkt);
    RT_TRACE (_module_hci_ops_os_c_, _drv_err_, ("%s: read port FAIL!\n", __FUNCTION__) );
    return NULL;
  }

  precvpriv = &padapter->recvpriv;
  precvbuf = rtw_dequeue_recvbuf (&precvpriv->free_recv_buf_queue);
  if (precvbuf == NULL) {
    rtw_skb_free (ppkt);
    DBG_871X_LEVEL (_drv_err_, "%s: alloc recvbuf FAIL!\n", __FUNCTION__);
    return NULL;
  }

  precvbuf->pskb = ppkt;

  precvbuf->len = ppkt->len;

  precvbuf->phead = ppkt->head;
  precvbuf->pdata = ppkt->data;
  precvbuf->ptail = skb_tail_pointer (precvbuf->pskb);
  precvbuf->pend = skb_end_pointer (precvbuf->pskb);

  return precvbuf;
}
#endif

static void sd_rxhandler (PADAPTER padapter, struct recv_buf * precvbuf)
{
  struct recv_priv * precvpriv;
  _queue * ppending_queue;
  
  
  precvpriv = &padapter->recvpriv;
  ppending_queue = &precvpriv->recv_buf_pending_queue;
  
  if (_rtw_queue_empty (ppending_queue) == _TRUE)
  {
    rtw_enqueue_recvbuf (precvbuf, ppending_queue);
    
    #ifdef PLATFORM_LINUX
    tasklet_schedule (&precvpriv->recv_tasklet);
    #endif
  }
  else
  { rtw_enqueue_recvbuf (precvbuf, ppending_queue); }
  
}

void sd_int_dpc (PADAPTER padapter)
{
  PHAL_DATA_TYPE phal;
  struct dvobj_priv * dvobj;
  struct intf_hdl * pintfhdl = &padapter->iopriv.intf;
  struct pwrctrl_priv * pwrctl;
  
  
  phal = GET_HAL_DATA (padapter);
  dvobj = adapter_to_dvobj (padapter);
  pwrctl = dvobj_to_pwrctl (dvobj);
  
  #ifdef CONFIG_SDIO_TX_ENABLE_AVAL_INT
  if (phal->sdio_hisr & SDIO_HISR_AVAL)
  {
    u8  freepage[4];
    
    _sdio_local_read (padapter, SDIO_REG_FREE_TXPG, 4, freepage);
    _rtw_up_sema (& (padapter->xmitpriv.xmit_sema) );
  }
  #endif
  if (phal->sdio_hisr & SDIO_HISR_CPWM1)
  {
    struct reportpwrstate_parm report;
    
    #ifdef CONFIG_LPS_RPWM_TIMER
    u8 bcancelled;
    _cancel_timer (& (pwrctl->pwr_rpwm_timer), &bcancelled);
    #endif
    
    report.state = SdioLocalCmd52Read1Byte (padapter, SDIO_REG_HCPWM1_8723B);
    
    #ifdef CONFIG_LPS_LCLK
    _set_workitem (& (pwrctl->cpwm_event) );
    #endif
  }
  
  if (phal->sdio_hisr & SDIO_HISR_TXERR)
  {
    u8 * status;
    u32 addr;
    
    status = rtw_malloc (4);
    if (status)
    {
      addr = REG_TXDMA_STATUS;
      HalSdioGetCmdAddr8723BSdio (padapter, WLAN_IOREG_DEVICE_ID, addr, &addr);
      _sd_read (pintfhdl, addr, 4, status);
      _sd_write (pintfhdl, addr, 4, status);
      DBG_8192C ("%s: SDIO_HISR_TXERR (0x%08x)\n", __func__, le32_to_cpu (* (u32 *) status) );
      rtw_mfree (status, 4);
    }
    else {
      DBG_8192C ("%s: SDIO_HISR_TXERR, but can't allocate memory to read status!\n", __func__);
    }
  }
  
  if (phal->sdio_hisr & SDIO_HISR_TXBCNOK)
  {
    DBG_8192C ("%s: SDIO_HISR_TXBCNOK\n", __func__);
  }
  
  if (phal->sdio_hisr & SDIO_HISR_TXBCNERR)
  {
    DBG_8192C ("%s: SDIO_HISR_TXBCNERR\n", __func__);
  }
  #ifndef CONFIG_C2H_PACKET_EN
  if (phal->sdio_hisr & SDIO_HISR_C2HCMD)
  {
    struct c2h_evt_hdr_88xx * c2h_evt;
    
    DBG_8192C ("%s: C2H Command\n", __func__);
    if ( (c2h_evt = (struct c2h_evt_hdr_88xx *) rtw_zmalloc (16) ) != NULL) {
      if (rtw_hal_c2h_evt_read (padapter, (u8 *) c2h_evt) == _SUCCESS) {
        if (c2h_id_filter_ccx_8723b ( (u8 *) c2h_evt) ) {
          /* Handle CCX report here */
          rtw_hal_c2h_handler (padapter, (u8 *) c2h_evt);
          rtw_mfree ( (u8 *) c2h_evt, 16);
        }
        else {
          rtw_c2h_wk_cmd (padapter, (u8 *) c2h_evt);
        }
      }
    }
    else {
      /* Error handling for malloc fail */
      if (rtw_cbuf_push (padapter->evtpriv.c2h_queue, (void *) NULL) != _SUCCESS)
      { DBG_871X ("%s rtw_cbuf_push fail\n", __func__); }
      _set_workitem (&padapter->evtpriv.c2h_wk);
    }
  }
  #endif
  
  if (phal->sdio_hisr & SDIO_HISR_RXFOVW)
  {
    DBG_8192C ("%s: Rx Overflow\n", __func__);
  }
  if (phal->sdio_hisr & SDIO_HISR_RXERR)
  {
    DBG_8192C ("%s: Rx Error\n", __func__);
  }
  
  if (phal->sdio_hisr & SDIO_HISR_RX_REQUEST)
  {
    struct recv_buf * precvbuf;
    int alloc_fail_time = 0;
    u32 hisr;
    
    phal->sdio_hisr ^= SDIO_HISR_RX_REQUEST;
    do {
      phal->SdioRxFIFOSize = SdioLocalCmd52Read2Byte (padapter, SDIO_REG_RX0_REQ_LEN);
      if (phal->SdioRxFIFOSize != 0)
      {
        #ifdef CONFIG_MAC_LOOPBACK_DRIVER
        sd_recv_loopback (padapter, phal->SdioRxFIFOSize);
        #else
        precvbuf = sd_recv_rxfifo (padapter, phal->SdioRxFIFOSize);
        if (precvbuf)
        { sd_rxhandler (padapter, precvbuf); }
        else
        {
          alloc_fail_time++;
          DBG_871X ("precvbuf is Null for %d times because alloc memory failed\n", alloc_fail_time);
          if (alloc_fail_time >= 10)
          { break; }
        }
        phal->SdioRxFIFOSize = 0;
        #endif
      }
      else
      { break; }
      
      hisr = 0;
      ReadInterrupt8723BSdio (padapter, &hisr);
      hisr &= SDIO_HISR_RX_REQUEST;
      if (!hisr)
      { break; }
    }
    while (1);
    
    if (alloc_fail_time == 10)
    { DBG_871X ("exit because alloc memory failed more than 10 times \n"); }
    
