jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/hal/rtl8723b/sdio/sdio_ops.c
  }
}

void sd_int_hdl (PADAPTER padapter)
{
  PHAL_DATA_TYPE phal;
  
  
  if ( (padapter->bDriverStopped == _TRUE) ||
       (padapter->bSurpriseRemoved == _TRUE) )
  { return; }
  
  phal = GET_HAL_DATA (padapter);
  
  phal->sdio_hisr = 0;
  ReadInterrupt8723BSdio (padapter, &phal->sdio_hisr);
  
  if (phal->sdio_hisr & phal->sdio_himr)
  {
    u32 v32;
    
    phal->sdio_hisr &= phal->sdio_himr;
    
    v32 = phal->sdio_hisr & MASK_SDIO_HISR_CLEAR;
    if (v32) {
      SdioLocalCmd52Write4Byte (padapter, SDIO_REG_HISR, v32);
    }
    
    sd_int_dpc (padapter);
  }
  else {
    RT_TRACE (_module_hci_ops_c_, _drv_err_,
              ("%s: HISR(0x%08x) and HIMR(0x%08x) not match!\n",
               __FUNCTION__, phal->sdio_hisr, phal->sdio_himr) );
  }
}

u8 HalQueryTxBufferStatus8723BSdio (PADAPTER padapter)
{
  PHAL_DATA_TYPE phal;
  u32 NumOfFreePage;
  
  
  phal = GET_HAL_DATA (padapter);
  
  NumOfFreePage = SdioLocalCmd53Read4Byte (padapter, SDIO_REG_FREE_TXPG);
  
  _rtw_memcpy (phal->SdioTxFIFOFreePage, &NumOfFreePage, 4);
  RT_TRACE (_module_hci_ops_c_, _drv_notice_,
            ("%s: Free page for HIQ(%#x),MIDQ(%#x),LOWQ(%#x),PUBQ(%#x)\n",
             __FUNCTION__,
             phal->SdioTxFIFOFreePage[HI_QUEUE_IDX],
             phal->SdioTxFIFOFreePage[MID_QUEUE_IDX],
             phal->SdioTxFIFOFreePage[LOW_QUEUE_IDX],
             phal->SdioTxFIFOFreePage[PUBLIC_QUEUE_IDX]) );
  
  return _TRUE;
}

u8 HalQueryTxOQTBufferStatus8723BSdio (PADAPTER padapter)
{
  HAL_DATA_TYPE * pHalData = GET_HAL_DATA (padapter);
  pHalData->SdioTxOQTFreeSpace = SdioLocalCmd52Read1Byte (padapter, SDIO_REG_OQT_FREE_PG);
  return _TRUE;
}

#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
u8 RecvOnePkt (PADAPTER padapter, u32 size)
{
  struct recv_buf * precvbuf;
  struct dvobj_priv * psddev;
  PSDIO_DATA psdio_data;
  struct sdio_func * func;
  
  u8 res = _FALSE;
  
  DBG_871X ("+%s: size: %d+\n", __func__, size);
  
  if (padapter == NULL) {
    DBG_871X (KERN_ERR "%s: padapter is NULL!\n", __func__);
    return _FALSE;
  }
  
  psddev = adapter_to_dvobj (padapter);
  psdio_data = &psddev->intf_data;
  func = psdio_data->func;
  
  if (size) {
    sdio_claim_host (func);
    precvbuf = sd_recv_rxfifo (padapter, size);
    
    if (precvbuf) {
      sd_rxhandler (padapter, precvbuf);
      res = _TRUE;
    }
    else {
      res = _FALSE;
    }
    sdio_release_host (func);
  }
  DBG_871X ("-%s-\n", __func__);
  return res;
}
#endif

